АлогистикТест2/src/Documents/алк_АктОТК/алк_АктОТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_АктОТК</name>
  <basedOn>Document.алк_АктОТК</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.алк_ДанныеАктаОТК</registerRecords>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОТК</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйАкт</name>
    <type>
      <types>DocumentRef.алк_АктОТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспытаний</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияИспытаний</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Колонки</name>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСсылочногоЗначения</name>
      <comment>!ВНИМАНИЕ! Полностью соответсвует списку типов реквизита СсылочноеЗначение из Регистра ДанныеАктаОТК</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСписокЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Строки</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьИзПроверкиКоличества</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Число</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенКЗаполнению</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Булево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокДопустимыхЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>355</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ДанныеАктаОТК/алк_ДанныеАктаОТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ДанныеАктаОТК</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СсылочноеЗначение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Влажность</types>
      <types>CatalogRef.Породы</types>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
      <types>CatalogRef.Длины</types>
      <types>CatalogRef.Сорта</types>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.алк_ШаблоныОТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_АктОТК/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_АктОТК") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"ШаблонОТК,Номер,Дата");
		СвязанныйАкт = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ШаблонОТК.ПроверятьКоличество
		И ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаАкта") Тогда		
			ТаблицаАктаТЗ = ЭтотОбъект.ДополнительныеСвойства.ТаблицаАкта;
			
			ОбщееКоличество = 0;
			ВсегоПроверено = 0;
			
			//Найдем общее количество
			СтрокиОбщегоКоличества = ТаблицаАктаТЗ.НайтиСтроки(Новый Структура("ОбщееКоличество", Истина));
			Для Каждого Стр Из СтрокиОбщегоКоличества Цикл
				ОбщееКоличество = ОбщееКоличество + Стр.Значение;		
			КонецЦикла;
			
			//Найдем сумму провереных значений строк,		
			СтрокиПроверкиКоличества = ТаблицаАктаТЗ.НайтиСтроки(Новый Структура("ОбщееКоличество,ИсключитьИзПроверкиКоличества", Ложь, Ложь));
			Для Каждого Стр Из СтрокиПроверкиКоличества Цикл
				ВсегоПроверено = ВсегоПроверено + Стр.Значение;		
			КонецЦикла;
						
			Если ОбщееКоличество <> 0 Тогда 
				Если ВсегоПроверено > ОбщееКоличество Тогда //Сверяем
					Сообщить("Ошибка. Количество листов с дефектами превышает общее количество листов. Запись документа невозможна.");
					Отказ = Истина;
				ИначеЕсли ШаблонОТК.КоличествоРавноСуммеЗначений И ВсегоПроверено <> ОбщееКоличество Тогда
					Сообщить("Ошибка. Количество проверено должно соответствовать количеству всего. Запись документа невозможна.");
					Отказ = Истина;	
				КонецЕсли;
			КонецЕсли;
			
	КонецЕсли;
		
	// Проверяем заполнение обязательных полей 	
	СтрокиПроверкиЗаполнения =  Реквизиты.НайтиСтроки(Новый Структура("ОбязателенКЗаполнению", Истина));
	Для Каждого Строка из СтрокиПроверкиЗаполнения цикл 
		Если не ЗначениеЗаполнено(Строка.Значение) тогда 
			Сообщить("Ошибка! Акт не может быть записан. Реквизит " + Строка.Реквизит + " не заполнен");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ Отказ Тогда
		//ПРоверияем правильность заполнения реквизитов, если в числовой реквизит заполнена строка отказ = истина
		РеквизитыСТипомЧисло = ЭтотОбъект.Реквизиты.НайтиСтроки(Новый Структура("Число", Истина));
		РеквизитыСТипомБулево = ЭтотОбъект.Реквизиты.НайтиСтроки(Новый Структура("Булево", Истина));
		
		Для Каждого Реквизит Из РеквизитыСТипомЧисло Цикл
			Если СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Реквизит.Значение) = Неопределено Тогда
				Сообщить("Ошибка! Акт не может быть записан. Реквизит " + Реквизит.Реквизит + " может иметь только числовое значение");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;  
		
		Для Каждого Реквизит Из РеквизитыСТипомБулево Цикл
			Если ЗначениеЗаполнено(Реквизит.Значение) И (Реквизит.Значение <> "+" И Реквизит.Значение <> "-") Тогда
				Сообщить("Ошибка! Акт не может быть записан. Реквизит " + Реквизит.Реквизит + " может иметь только значение + или - ");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;  
	
	Если НЕ Отказ Тогда	
		Движения.алк_ДанныеАктаОТК.Записывать = Истина;
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаАкта") Тогда
			
			ТаблицаАктаТЗ = ЭтотОбъект.ДополнительныеСвойства.ТаблицаАкта;
			
			Для Каждого Строка Из ТаблицаАктаТЗ Цикл  
				
				//Проверка на пустые строки
				МассивЗначений = Новый Массив;
				
				Если ШаблонОТК.ДобалениеСтрокВТаблицеАкта  Тогда
					Если НЕ ЗначениеЗаполнено(Строка.ПерваяКолонка) И НЕ ЗначениеЗаполнено(Строка.ПерваяКолонкаСерийный) Тогда 
						Сообщить("Ошибка! Акт не может быть записан. В табличной части есть строки с незаполненными колонками. Удалите пустые строки!"); 
						Отказ = Истина;	
					ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ПерваяКолонкаСерийный) И ЭтотОбъект.ШаблонОТК.ПоПакетам Тогда	
				        Сообщить("Ошибка! Акт не может быть записан. В табличной части есть строки с незаполненными колонками. Удалите пустые строки!"); 
						Отказ = Истина;	
					ИначеЕсли ЗначениеЗаполнено(Строка.ПерваяКолонка) и НЕ ЭтотОбъект.ШаблонОТК.ПоПакетам Тогда
						Для Каждого Колонка Из ТаблицаАктаТЗ.Колонки Цикл
							
							Если Колонка.Имя = "ПерваяКолонка"  
								ИЛИ Колонка.Имя = "ПерваяКолонкаСерийный"
								ИЛИ Колонка.Имя = "Группа"
								ИЛИ Колонка.Имя = "ОбщееКоличество"
								ИЛИ Колонка.Имя = "ИсключитьИзПроверкиКоличества" Тогда //Пропускаем стандартные колонки
								Продолжить;  
							КонецЕсли; 
							
							Если ЗначениеЗаполнено(Строка[Колонка.Имя])Тогда
								МассивЗначений.Добавить(Строка[Колонка.Имя]);
							КонецЕсли;	
							
						КонецЦикла;              
						
						Если МассивЗначений.Количество() = 0 Тогда
							Сообщить("Ошибка! Акт не может быть записан. В строке " + Строка.ПерваяКолонка + " не заполнены колонки. Удалите данную строку!"); 
							Отказ = Истина;	
						КонецЕсли; 
						
					КонецЕсли;  	
				КонецЕсли; 
				//
				
				Для Каждого Колонка Из ТаблицаАктаТЗ.Колонки Цикл
					
					Если НЕ ЭтотОбъект.Колонки.Количество() = 0 И Колонка.Имя = "ПерваяКолонкаСерийный" Тогда 
						Продолжить;  			
					КонецЕсли;
					
					Если Колонка.Имя = "ПерваяКолонка" 
						ИЛИ Колонка.Имя = "Группа"
						ИЛИ Колонка.Имя = "ОбщееКоличество"
						ИЛИ Колонка.Имя = "ИсключитьИзПроверкиКоличества" Тогда //Пропускаем первую колонку
						Продолжить;  
					КонецЕсли;
							
					ЗначенияВРегистр = Новый Массив;
					
					Если ТипЗнч(Строка[Колонка.Имя]) = Тип("СписокЗначений") Тогда
						Для Каждого Стр Из Строка[Колонка.Имя] Цикл
							ЗначенияВРегистр.Добавить(Стр.Значение);			
						КонецЦикла;
					Иначе
						ЗначенияВРегистр.Добавить(Строка[Колонка.Имя]);
					КонецЕсли;			
					
					УникальныйНомер = 1;
					
					Для Каждого Значение Из ЗначенияВРегистр Цикл 
						
						Движение = Движения.алк_ДанныеАктаОТК.Добавить();
						Движение.Период = Дата;
						Движение.Активность	= НЕ ЭтотОбъект.ПометкаУдаления;	
						Движение.Шаблон = ШаблонОТК;    
						Если НЕ ЭтотОбъект.Колонки.Количество() = 0 Тогда  
							Движение.Колонка = Колонка.Имя;  
						КонецЕсли;
                        //
						Если ЭтотОбъект.ШаблонОТК.ПоПакетам Тогда
							Движение.СерийныйНомер = Строка.ПерваяКолонкаСерийный;	
						Иначе 
							Движение.Строка = Строка.ПерваяКолонка; 	
						КонецЕсли; 
					
						Если ТипЗнч(Значение) = Тип("Число") Тогда 
							Движение.Значение = Значение;
						Иначе
							Движение.СсылочноеЗначение = Значение;	
						КонецЕсли;
						Движение.Группа = Строка.Группа;
						Движение.УникальныйНомер = УникальныйНомер; 
											
						УникальныйНомер = УникальныйНомер + 1;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
		Иначе
			Движения.алк_ДанныеАктаОТК.Прочитать();
			Движения.алк_ДанныеАктаОТК.УстановитьАктивность(НЕ ЭтотОбъект.ПометкаУдаления);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
